[
  {
    "FullName": "Abdifatah Ahmed Ibrahim",
    "ResearchAreaInterest": "CEO @ Garaad Systems",
    "Bio": "Software Engineer and Community Development Volunteer",
    "Picture": "AbdifatahAhmedIbrahim.jpeg",
    "GithubWebsite": "https://github.com/abdifatahibrahimkare",
    "LinkedinWebsite": ""
  },
  {
    "FullName": "Abenezer Kebede Angamo",
    "ResearchAreaInterest": "Software Engineer @ ChipChip",
    "Bio": "Software Engineer",
    "Picture": "AbenezerKebedeAngamo.png",
    "GithubWebsite": "https://github.com/AbenezerKb",
    "LinkedinWebsite": "https://www.linkedin.com/in/dev-abenezer"
  },
  {
    "FullName": "Alpha Lencho",
    "ResearchAreaInterest": "Assistant Data Officie @ REACH Initiative",
    "Bio": "Alpha Lencho is a final-year Information Systems student at Addis Ababa University, graduating in 2017 E.C. He is passionate about working with data and exploring its potential. His main interests are in Machine Learning, especially Natural Language Processing and Computer Vision. Alpha enjoys turning data into meaningful insights to solve real-world problems.",
    "Picture": "AlphaLencho.jpeg",
    "GithubWebsite": "https://github.com/Alpha-Mintamir",
    "LinkedinWebsite": "https://www.linkedin.com/in/alpha-lencho-13b8281bb/"
  },
  {
    "FullName": "Amir Ahmedin",
    "ResearchAreaInterest": "Flutter Developer @ A2SV",
    "Bio": "Computer Vision, Machine Learning",
    "Picture": "AmirAhmedin.png",
    "GitWb/website": "https://github.com/IbnuEyni",
    "LinkeWn/website ": "https://www.linkedin.com/in/amir-ahmedin-812349264/"
  },
  {
    "FullName": "Dawit Getahun Mengistu",
    "ResearchAreaInterest": "ML/AI Engineer @ TestSavantAI",
    "Bio": "An under-grad student at at Addis Ababa Institute of Technology, studying software-engineering in the stream of AI, equipped with solid foundations of computer science principles and advanced coursework in AI and machine learning. Passionate about research and theoretical advancements. ",
    "Picture": "DawitGetahunMengistu.jpg",
    "GithubWebsite": "https://github.com/dawit-getahun-mengistu",
    "LinkedinWebsite": "https://www.linkedin.com/in/dawit-getahun-mengistu/"
  },
  {
    "FullName": "Elias Girma",
    "ResearchAreaInterest": "IT Specialist @ CDC Project AA Health Buereau",
    "Bio": "Elias Girma is an IT Specialist with a strong interest in Artificial Intelligence (AI) and Machine Learning (ML). He has experience in cybersecurity, data engineering, data analysis, and image processing. Elias is passionate about leveraging technology to create impactful solutions and drive innovation.",
    "Picture": "EliasGirma.jpg",
    "GithubWebsite": "https://sites.google.com/view/eliasgirmasportfolio/",
    "LinkedinWebsite": "www.linkedin.com/in/elias-hurisa-155a09283/"
  },
  {
    "FullName": "Firi Berhane",
    "ResearchAreaInterest": "AI Programmer @ ConDigital",
    "Bio": "AI Engineer with a passion for computer vision, natural language processing, and generative AI research. Currently focused on developing AI agents and building conversational AI applications.",
    "Picture": "FiriBerhane.jpg",
    "GithubWebsite": "https://firi193.github.io/",
    "LinkedinWebsite": "https://www.linkedin.com/in/firi-berhane-7b3a05232/"
  },

  {
    "FullName": "Haileyesus Kassahun Dessie",
    "ResearchAreaInterest": "BSc Computer Science @ AAU",
    "Bio": "Senior computer science student at Addis Ababa University; Watched Breaking Bad 4x; Favorite superhero is Spiderman :)",
    "Picture": "HaileyesusKassahunDessie.webp",
    "GithubWebsite": "https://github.com/blackmammoth",
    "LinkedinWebsite": "https://www.linkedin.com/in/haileyesus-dessie-677a86222/"
  },
  {
    "FullName": "Hana Andargie Kassie",
    "ResearchAreaInterest": "Research Assistant: Robotics Dept @ University of Michigan",
    "Bio": "I'm Hana Andargie Kassie, and I recently completed my Bachelor's degree in Electrical and Computer Engineering at  Addis Ababa University, graduating in June 2024. During my studies, I focused on Robotics, Human-Robot Interaction (HRI), and Human-Autonomy Teaming, exploring how humans and autonomous systems can collaborate effectively.  \nI have worked on projects like developing an autonomous human-following trolley with deep learning and contributing to human-autonomous vehicle interaction research during my internship at the University of Michigan. Currently, I'm volunteering as a Web Developer, honing my skills and contributing to impactful projects.  \nI'm passionate about integrating technology with human-centric approaches to solve real-world challenges and create innovative solutions.",
    "Picture": "HanaAndargieKassie.jpg",
    "GithubWebsite": "https://github.com/HanaAndargie",
    "LinkedinWebsite": "https://www.linkedin.com/in/hana-kassie-19b326227/"
  },
  {
    "FullName": "Henok Belayneh",
    "ResearchAreaInterest": "Network Engineer @ CBE",
    "Bio": "I'm Henok Belayneh, a 4th-year Electrical and Computer Engineering student at AAiT. I've always been passionate about physics, mathematics, and quantum computing-they're what drive me to explore and learn. My research interests include computer vision and machine learning, and I'm currently working on robotics and AI projects as a building and automation engineer for the AAiT Robotics and AI Club.\nOutside of all the technical stuff, I love sketching and graphic design-it's my way of staying creative and balanced.",
    "Picture": "HenokBelayneh.jpg",
    "GithubWebsite": "https://github.com/Henibela",
    "LinkedinWebsite": "www.linkedin.com/in/henok-belayneh"
  },
  {
    "FullName": "Joshua Tadesse Mekuriaw",
    "ResearchAreaInterest": "CEO, CTO @ Elder Studios",
    "Bio": "My name is Joshua Mekuriaw. I am an enthusiastic and hard-working computer engineer who likes embarking on challenging problems. I am passionate about solving real-life problems with software and AI, and I have over 2 years of professional experience in the field. I like doing 3D graphics and art, writing short books, and developing video games.",
    "Picture": "JoshuaTadesseMekuriaw.jpg",
    "GithubWebsite": "https://github.com/JoshuaTadesse",
    "LinkedinWebsite": "https://www.linkedin.com/in/joshua-tadesse-aa8081225/"
  },
  {
    "FullName": "Khalid Mohammed",
    "ResearchAreaInterest": "Full Stack Developer @ CBE",
    "Bio": "Passionate AI researcher and developer specializing in Explainable AI (XAI), Computer Vision, Robotics, NLP, LLMs, and Cybersecurity. I hold an MSc in Computer Science and Engineering (AI & XAI) and a dual BSc in Computer Science & Engineering and Electronics & Communication Engineering. My research focuses on ethical AI, accountability, and interpretable deep learning, particularly within the cybersecurity domain. With expertise in RLHF-based AI training, data analysis, threat intelligence, and AI-driven fintech and cybersecurity solutions, I have a strong background in competitive programming and full-stack development, excelling in solving complex challenges and driving innovation in responsible and transparent AI solutions.",
    "Picture": "KhalidMohammed.JPG",
    "GithubWebsite": "https://github.com/Khayo-7",
    "LinkedinWebsite": "https://www.linkedin.com/in/khalid-7-mohammed/"
  },
  {
    "FullName": "Lealem Kinfe Alula",
    "ResearchAreaInterest": "Operations Assistant @ International Space University",
    "Bio": "Hi, I'm Lealem Kinfe, a Computer Engineer and Space Science Communicator with a passion for exploring the intersection of technology and space. I have a strong background in computer engineering, HCI (Human-Computer Interaction), and AI, with a particular interest in deep learning, computer vision, and low-resource language NLP. As a member of the Computer Vision and Graphics Research Initiative, I worked on the Flash Stage - Relighting with Flashlight project, where I contributed to cutting-edge research in computer vision techniques. I have extensive experience in project management, digital science communication, and leadership within the space science sector, and I am always driven to push the boundaries of technology to solve complex problems and drive innovation.",
    "Picture": "LealemKinfeAlula.png",
    "GithubWebsite": "https://github.com/lealemkinfe",
    "LinkedinWebsite": "https://www.linkedin.com/in/lealem-kinfe/"
  },
  {
    "FullName": "Mahlet Assefa Girma",
    "ResearchAreaInterest": "Mobile Developer Associate @ AASTU Software Engineers Association",
    "Bio": "Hi, I'm Mahlet Assefa, a 4th-year Software Engineering student at AASTU. I dive into Computer Vision, with a focus on image segmentation and its practical applications. I enjoy turning ideas into impactful solutions and collaborating on projects that push AI forward.",
    "Picture": "MahletAssefaGirma.jpg",
    "GithubWebsite": "https://github.com/Mahlet-assefa",
    "LinkedinWebsite": "https://www.linkedin.com/in/mahlet-assefa-b060062a2 "
  },
  {
    "FullName": "Mebatsion Sahle",
    "ResearchAreaInterest": "Data Engineer @ Nexsis Analytics",
    "Bio": "Computer Science Engineer | Researcher ",
    "Picture": "MebatsionSahle.jpg",
    "GithubWebsite": "https://github.com/mebsahle",
    "LinkedinWebsite": "https://www.linkedin.com/in/mebsahle/"
  },
  {
    "FullName": "Milky Mohammed Hasena",
    "ResearchAreaInterest": "User Experience Designer @ Start-Up",
    "Bio": "My name is Milky Hasena, and I am a passionate web developer, UI/UX designer, game developer, and designer, as well as a 3D animator and modeler. I have a deep interest in computer graphics, game development and design, and web development. In my free time, I love to animate and experiment with 3D objects, often creating games for fun using the Unity game engine. I thrive on the creativity and challenges that come with these fields, constantly seeking to learn and innovate.",
    "Picture": "MilkyMohammedHasena.jpg",
    "GithubWebsite": "https://github.com/milkymohammed",
    "LinkedinWebsite": "https://www.linkedin.com/in/milky-hasena"
  },
  {
    "FullName": "Nahom Temesgen Retebo",
    "ResearchAreaInterest": "Technical Artist @ ARMA Advertising",
    "Bio": "I am passionate about computer graphics and physically based animation, with focus on real-time applications such as video games.",
    "Picture": "NahomTemesgenRetebo.jpg",
    "GithubWebsite": "http://github.com/nonyx777",
    "LinkedinWebsite": "http://linkedin.com/in/nahomtemesgen"
  },
  {
    "FullName": "Naomi Eskinder Woudneh",
    "ResearchAreaInterest": "Software Engineer Intern @ HPE",
    "Bio": "I am passionate about High Performance Computing, Computer Architechture and Systems Engineering.",
    "Picture": "NaomiEskinderWoudneh.jpeg",
    "GithubWebsite": "http://github.com/naomesk",
    "LinkedinWebsite": "http://linkedin.com/in/naomi-eskinder-woudneh"
  },
  {
    "FullName": "Nanati Oumer ",
    "ResearchAreaInterest": "User Experience Designer @ PTGR AG",
    "Bio": "I'm Nanati Oumer, a graduate in Computer Science and Engineering, currently working as a website developer and UI/UX designer. My passion lies in computer graphics, computer vision, and machine learning, particularly in how they can make a meaningful impact on the world. I'm excited to pursue research and projects in these fields, aiming to develop innovative solutions that improve how we connect, create, and experience the world through technology.",
    "Picture": "NanatiOumer.jpg",
    "GithubWebsite": "https://github.com/nani020",
    "LinkedinWebsite": "https://www.linkedin.com/in/nanati-oumer-7133631b0/"
  },
  {
    "FullName": "Seifegebreal Mosisa",
    "ResearchAreaInterest": "Data Scientist & Engineer @ Arifpay",
    "Bio": "I'm an AI/ML enthusiast with a passion for exploring the cutting edge of Generative AI and Computer Vision. I thrive on uncovering innovative ways these technologies can transform ideas into reality!",
    "Picture": "SeifegebrealMosisa.jpg",
    "GithubWebsite": "https://www.github.com/Seife1",
    "LinkedinWebsite": "https://www.linkedin.com/in/seifemosi"
  },
  {
    "FullName": "Sosna Worku Achamyeleh",
    "ResearchAreaInterest": "Assitant Lecturer @ AAU",
    "Bio": "Sosna is interested in visual foundation models and applying machine learning in healthcare, particularly for diagnosing brain diseases. She also enjoys teaching and contributing to academia.",
    "Picture": "SosnaWorkuAchamyeleh.png",
    "GithubWebsite": "https://sossyh.github.io/",
    "LinkedinWebsite": "https://www.linkedin.com/in/sosna-achamyeleh/"
  },
  {
    "FullName": "Tamiru Alemnew ",
    "ResearchAreaInterest": "BSc Computer Science @ AAU",
    "Bio": "Tamiru Alemnew is a Software Engineering student at Addis Ababa University with a strong academic background. He is a skilled full-stack developer with expertise in Python ,C ++JavaScript, and Go. Tamiru has extensive experience in building scalable applications, leading teams, and contributing to impactful open-source projects. With a solid foundation in data structures and algorithms, gained through competitive programming, he excels at tackling challenging problems. As a fast learner, he is eager to continuously grow and drive innovation through technology.\n",
    "Picture": "TamiruAlemnew.jpeg",
    "GithubWebsite": "https://github.com/Tamiru-Alemnew",
    "LinkedinWebsite": "https://linkedin.com/in/tamiru-alemnew/"
  },
  {
    "FullName": "Tinsae Tadesse Anteneh",
    "ResearchAreaInterest": "Research Fellow @ MIT",
    "Bio": "I'm Tinsae Tadesse Anteneh, a 4th-year Software Engineering (AI stream) student and freelance web developer. Passionate about AI, ML, CV, NLP, Web Dev, Graphics, Math & DSA, I thrive on solving real-world problems and exploring innovative solutions. I also enjoy chess and basketball!",
    "Picture": "TinsaeTadesseAnteneh.jpg",
    "GithubWebsite": "https://github.com/TinsaeTadesse17",
    "LinkedinWebsite": "www.linkedin.com/in/tinsae-tadesse-anteneh"
  },
  {
    "FullName": "Tsehay Goremes",
    "ResearchAreaInterest": "ML Engineer @ TalentBricks",
    "Bio": "I'm a passionate Machine Learning Engineer with expertise in Python, TensorFlow, and PyTorch. I have hands-on experience in OCR projects, data analysis, and computer vision. My work includes developing AI solutions for healthcare and creating recognition pipelines for diverse languages and scripts. I am committed to leveraging AI for impactful innovations.",
    "Picture": "TsehayGoremes.jpg",
    "GithubWebsite": "Github.com/tseehay",
    "LinkedinWebsite": "Linkedin.com/in/tsehay-goremes-934b16222/"
  },
  {
    "FullName": "Yared Solomon",
    "ResearchAreaInterest": "Full Stack Engineer @ Rejuve.AI",
    "Bio": "Aspiring AI innovator passionate about creating human-like robots by bridging neuroscience, robotics, and artificial intelligence to emulate human cognition and behavior",
    "Picture": "YaredSolomon.jpg",
    "GithubWebsite": "https://github.com/yared123yared",
    "LinkedinWebsite": "https://www.linkedin.com/in/yared-solomon-740a85184/"
  },
  {
    "FullName": "Zemzem Hibet Oumer",
    "ResearchAreaInterest": "MSc Artificial Intelligence @ AAU",
    "Bio": "Zemzem Hibet is an MSc in Artificial Intelligence student at Addis Ababa University with a strong passion for computer vision and natural language processing. Recently, she completed the Computer Vision & Graphics Research Initiative, where she gained hands-on experience in research. With a commitment to advancing AI technologies, Zemzem aspires to develop innovative solutions that address real-world challenges and push the boundaries of scientific discovery.",
    "Picture": "ZemzemHibetOumer.jpg",
    "GithubWebsite": "https://github.com/zumi123",
    "LinkedinWebsite": "https://www.linkedin.com/in/zemzem-hibet-69a430178?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=android_app"
  }
]
